
[   
    { "id" : 1, "songs" : "TiK ToK ", "singer" : " Ke$ha ",  "lyrics": "--Wake up in the mornin' feelin' like P-Diddy (hey what's up girl)--Grab my glasses I'm out the door I'm gonna hit the city (let's go)--Before I leave brush my teeth with a bottle of Jack--'Cause when I leave for the night I ain't comin' back----I'm talkin' pedicure on our toes toes--Tryin' on all our clothes clothes--Boys blowin' up our phones phones----Drop top and playin' our favorite CD's--Pullin' up to the parties--Tryna get a little bit tipsy----Don't stop, make it pop--DJ, blow my speakers up--Tonight, Imma fight--'Til we see the sunlight--TiK ToK, on the clock--But the party don't stop no--Whoa-oh oh oh--Whoa-oh oh oh----Don't stop, make it pop--DJ, blow my speakers up--Tonight, Imma fight--'Til we see the sunlight--TiK ToK, on the clock--But the party don't stop no--Whoa-oh oh oh--Whoa-oh oh oh----Ain't got a care in world, but got plenty of beer--Ain't got no money in my pocket, but I'm already here--Now, the dudes are linin' up cause they hear we got swagger--But we kick em to the curb unless they look like Mick Jagger----I'm talkin' bout - everybody getting crunk, crunk--Boys tryna touch my junk, junk--Gonna smack him if he getting too drunk, drunk--Now, now - we goin' 'til they kick us out, out--Or the police shut us down, down--Police shut us down, down--Po-po shut us - (down)-man----Don't stop, make it pop--DJ, blow my speakers up--Tonight, Imma fight--'Til we see the sunlight--TiK ToK, on the clock--But the party don't stop no--Whoa-oh oh oh--Whoa-oh oh oh----Don't stop, make it pop--DJ, blow my speakers up--Tonight, Imma fight--'Til we see the sunlight--TiK ToK, on the clock--But the party don't stop no--Whoa-oh oh oh--Whoa-oh oh oh----DJ, you build me up--You break me down--My heart, it pounds--Yeah, you got me--With my hands up--You got me now--You got that sound--Yeah, you got me----You build me up--You break me down--My heart, it pounds--Yeah, you got me--With my hands up--Put your hands up--Put your hands up----Now--The party don't start 'til I walk in----Don't stop, make it pop--DJ, blow my speakers up--Tonight, Imma fight--'Til we see the sunlight--TiK ToK, on the clock--But the party don't stop no--Whoa-oh oh oh--Whoa-oh oh oh----Don't stop, make it pop--DJ, blow my speakers up--Tonight, Imma fight--'Til we see the sunlight--TiK ToK, on the clock--But the party don't stop no--Whoa-oh oh oh--Whoa-oh oh oh"},
    { "id" : 2, "songs" : " Airplanes ", "singer" : " B.o.B Featuring Hayley Williams ", "lyrics": "--Can we pretend that airplanes in the night sky are like shootin' stars--I could really use a wish right now, wish right now, wish right now--Can we pretend that airplanes in the night sky are like shootin' stars--I could really use a wish right now, wish right now, wish right now--Yeah, yeah I could use a dream or a genie or a wish--To go back to a place much simpler than this--Cause after all the partying and smashing and crashing--And all the glitz and glam and the fashion--And all the pandemonium and all the madness--There comes a time when you fade to the blackness--And when you're staring at the phone in your lap--And you hoping but them people never call you back--But that's just how the story unfolds--You get another hand soon after you fold--And when your plans unravel in the sand--What would you wish for, if you had one chance?--So airplane airplane sorry I'm late--I'm on my way so don't close that gate--If I don't make that then I'll switch my flight and--I'll be right back at it by the end of the night--Can we pretend that airplanes in the night sky are like shootin' stars--I could really use a wish right now, wish right now, wish right now--Can we pretend that airplanes in the night sky are like shootin' stars--I could really use a wish right now, wish right now, wish right now--Yeah yeah somebody take me back to the days--Before this was a job before I got paid--Before it ever mattered what I had in my bank--Yeah back when I was trying to get a tip at subway--And back then I was rapping for the hell of it--But nowadays we rapping to stay relevant--I'm guessing if can make some wishes out of airplanes--Then maybe oh maybe I'll go back to the days--Before the politics that we call the rap game--And back when ain't nobody listened to my mix tape--And back before when I tried to cover up my slang--But this is for the Decatur what's up Bobby Ray--So can I get a wish to end the politics--And get back to the music that started this shit--So here I stand and then again I say--I'm hoping we can make some wishes outta airplanes--Can we pretend that airplanes in the night sky are like shootin' stars--I could really use a wish right now, wish right now, wish right now--Can we pretend that airplanes in the night sky are like shootin' stars--I could really use a wish right now, wish right now, wish right now--I could really use a wish right now--I, I, I could really use a wish right now--Like, like, like shootin' stars--I, I, I could really use a wish right now--A wish a wish right now--"},  
    { "id" : 3, "songs" : "Bad Romance ", "singer" : "Lady Gaga", "lyrics": "--Oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh!--Caught in a bad romance--Oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh!--Caught in a bad romance----Rah-rah-ah-ah-ah-ah!--Roma-roma-mamaa!--Ga-ga-ooh-la-la!--Want your bad romance----Rah-rah-ah-ah-ah-ah!--Roma-roma-mamaa!--Ga-ga-ooh-la-la!--Want your bad romance----I want your ugly--I want your disease--I want your everything--As long as it's free--I want your love--(Love-love-love I want your love)----I want your drama--The touch of your hand--I want your leather-studded kiss in the sand--I want your love--Love-love-love--I want your love--(Love-love-love I want your love)----You know that I want you--And you know that I need you--I want it bad, your bad romance----I want your love and--I want your revenge--You and me could write a bad romance--(Oh-oh-oh--oh-oh!)--I want your love and--All your lover's revenge--You and me could write a bad romance----Oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh!--Caught in a bad romance--Oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh!--Caught in a bad romance----Rah-rah-ah-ah-ah-ah!--Roma-roma-mamaa!--Ga-ga-ooh-la-la!--Want your bad romance----I want your horror--I want your design--‘Cause you're a criminal--As long as you're mine--I want your love--(Love-love-love I want your love-uuhh)----I want your psycho--Your vertigo shtick--Want you in my rear window--Baby you're sick--I want your love--Love-love-love--I want your love--(Love-love-love I want your love)----You know that I want you--('Cause I'm a free bitch baby!)--And you know that I need you--I want it bad, bad romance----I want your love and--I want your revenge--You and me could write a bad romance--(Oh-oh-oh-oh-oh!)--I want your love and--All your lover's revenge--You and me could write a bad romance----Oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh!--Caught in a bad romance--Oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh!--Caught in a bad romance----Rah-rah-ah-ah-ah-ah!--Roma-roma-mamaa!--Ga-ga-ooh-la-la!--Want your bad romance----Rah-rah-ah-ah-ah-ah!--Roma-roma-mamaa!--Ga-ga-ooh-la-la!--Want your bad romance----Walk, walk fashion baby--Work it--Move that bitch crazy----Walk, walk fashion baby--Work it--Move that bitch crazy----Walk, walk fashion baby--Work it--Move that bitch crazy----Walk, walk passion baby--Work it--I'm a free bitch, baby----I want your love and--I want your revenge--I want your love--I don't wanna be friends----Je veux ton amour--Et je veux ta revanche--Je veux ton amour--I don't wanna be friends--Oh-oh-oh-oh-oooh!--I don't wanna be friends--(Caught in a bad romance)--I don't wanna be friends--Oh-oh-oh-oh-oooh!--Want your bad romance--(Caught in a bad romance)--Want your bad romance!----I want your love and--I want your revenge--You and me could write a bad romance--Oh-oh-oh-oh-oooh!--I want your love and--All your lover's revenge--You and me could write a bad romance----Oh-oh-oh-oh-oooh-oh-oh-oooh-oh-oh-oh-oh!--Want your bad romance--(Caught in a bad romance)--Want your bad romance----Oh-oh-oh-oh-oooh-oh-oh-oooh-oh-oh-oh-oh!--Want your bad romance--(Caught in a bad romance)----Rah-rah-ah-ah-ah-ah!--Roma-roma-mamaa!--Ga-ga-ooh-la-la!--Want your bad romance----"},
    { "id" : 4, "songs" : " Dynamite ", "singer" : " Taio Cruz ", "lyrics": "I throw my hands up in the air sometimes--Saying AYO! Gotta let go!--I wanna celebrate and live my life--Saying AYO! Baby, let's go!----I came to dance, dance, dance, dance--I hit the floor 'cause that's my plans, plans, plans, plans--I'm wearing all my favorite brands, brands, brands, brands--Give me some space for both my hands, hands, hands, hands----Yeah, yeah----'Cause it goes on and on and on...--And it goes on and on and on...----Yeah!----I throw my hands up in the air sometimes--Saying AYO! Gotta let go!--I wanna celebrate and live my life--Saying AYO! Baby, let's go!----'Cause we gon' rock this club--We gon' go all night--We gon' light it up--Like it's dynamite!--'Cause I told you once--Now I told you twice--We gon' light it up--Like it's dynamite!----I came to move, move, move, move--Get out the way of me and my crew, crew, crew, crew--I'm in the club so I'm gonna do, do, do, do--Just what the fuck, came here to do, do, do, do----Yeah, yeah----'Cause it goes on and on and on...--And it goes on and on and on...----Yeah!----I throw my hands up in the air sometimes--Saying AYO! Gotta let go!--I wanna celebrate and live my life--Saying AYO! Baby, let's go!----'Cause we gon' rock this club--We gon' go all night--We gon' light it up--Like it's dynamite!--'Cause I told you once--Now I told you twice--We gon' light it up--Like it's dynamite!----I'm gonna take it all--I, I'm gonna be the last one standing--Higher over all--I, I'm gonna be the last one landing--'Cause I, I, I believe it--And I, I, I, I just want it all...--I just want it all...--I'm gonna put my hands in the air!--Hands, hands in the air!--Put your hands in the air!----I throw my hands up in the air sometimes--Saying AYO! Gotta let go!--I wanna celebrate and live my life--Saying AYO! Baby, let's go!----'Cause we gon' rock this club--We gon' go all night--We gon' light it up--Like it's dynamite!--'Cause I told you once--Now I told you twice--We gon' light it up--Like it's dynamite!" }, 

    { "id" : 5, "songs" : "California Gurls", "singer" : "Katy Perry Featuring Snoop Dogg", "lyrics": "[Snoop Dogg:]--Greetings, loved ones--Let's take a journey----[Katy:]--I know a place--Where the grass is really greener--Warm, wet and wild--There must be something in the water--Sippin' gin and juice--Laying underneath the palm trees (undone)--The boys break their necks--Tryna creep a little sneak peek (at us)----You could travel the world--But nothing comes close--To the golden coast--Once you party with us--You'll be falling in love----California girls--We're unforgettable--Daisy Dukes--Bikinis on top--Sun-kissed skin--So hot--We'll melt your popsicle----California girls--We're undeniable--Fine, fresh, fierce--We got it on lock--West Coast represent--Now put your hands up----Sex on the beach--We don't mind sand in our stilettos--We freak in my Jeep--Snoop Doggy Dogg on the stereo----You could travel the world--But nothing comes close--To the golden coast--Once you party with us--You'll be falling in love----California girls--We're unforgettable--Daisy Dukes--Bikinis on top--Sun-kissed skin so hot--We'll melt your popsicle----California girls--We're undeniable--Fine, fresh, fierce--We got it on lock--West Coast represent--(West Coast)--Now put your hands up----[Snoop Dogg:]--Toned, tan, fit and ready--Turn it up 'cause it's gettin' heavy--Wild Wild West Coast--These are the girls I love the most--I mean the ones--I mean like she's the one--Kiss her, touch her, squeeze her buns----The girl's a freak--She drive a Jeep--And live on the beach--I'm okay--I won't play--I love the bait--Just like I love LA--Venice Beach and Palm Springs--Summertime is everything----Homeboys--Bangin' out--All that ass hangin' out--Bikinis, zucchinis--Martinis, no weenies--Just the King and the Queeny--Katy, my lady (yeah)--Lookie here, baby (uh huh)--I'm all up on ya--'Cause you're representin' California (oh yeah)----[Katy:]--California girls--We're unforgettable--Daisy Dukes--Bikinis on top--Sun-kissed skin so hot--We'll melt your popsicle----California girls--We're undeniable--Fine, fresh, fierce--We got it on lock--West Coast represent--(West Coast, West Coast)--Now put your hands up----[Snoop Dogg:]--(California, California girls)--California girls, man--(California, California girls)"},
    { "id" : 6,"songs" : "In My Head ", "singer" : "Jason Derulo", "lyrics": "Jason Derülo.--Beluga Heights.--J. J. J. J. J. R.--Come on.----Everybody's looking for love.--Ain't that the reason you're at this club.--You ain't gon' find it dancing with him. No.--I've got a better solution for you, girl.----Just leave with me now. Say the word and we'll go.--I'll be your teacher. I'll show you the ropes.--You'll see a side of love you've never known.--I can see it going down, going down.----In my head I see you all over me.--In my head you fulfill my fantasy.--In my head you'll be screaming more.--In my head it's going down.--In my head it's going down.--In my head. In my head.----Come on.----Some dudes know all the right things to say.--When it comes down to it, it's all just game.--Instead of talking let me demonstrate.--Get down to business and skip foreplay.----Just leave with me now. Say the word and we'll go. We can go.--I'll be your teacher. I'll show you the ropes.--You'll see a side of love you've never known.--I can see it going down, going down.----In my head I see you all over me. Baby, all over me.--In my head you fulfill my fantasy.--In my head you'll be screaming more.--In my head it's going down.--In my head it's going down.--In my head.----Break it down. Come on. Let's go.--You're singing to me baby in my head right now.--Come on.--She'll be screaming out when it all goes down.----Just leave with me now. Say the word and we'll go. We can go.--I'll be your teacher. I'll show you the ropes.--You'll see a side of love you've never known.--I can see it going down, going down.----In my head I see you all over me.--In my head you fulfill my fantasy.--In my head you'll be screaming more.--In my head it's going down.--In my head it's going down.----In my head I see you all over me. All over you.--In my head you fulfill my fantasy.--In my head you'll be screaming more.--In my head it's going down.--In my head it's going down.--In my head.--"},
    { "id" : 7, "songs" : "Break Your Heart ", "singer" : "Taio Cruz Featuring Ludacris", "lyrics": "--Whoa, oh--Whoa, oh--Whoa, oh--Whoa, oh--Now listen to me baby (oh, oh-oh)--Before I love and leave you (oh, oh-oh)--They call me heart breaker (oh, oh-oh)--I don't wanna deceive you (oh, oh-oh)--If you fall for me--I'm not easy to please--I'm might tear you apart--Told you from the start, baby, from the start--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--Whoa, oh--Whoa, oh--There's no point tryna hide it (oh, oh-oh)--No point tryna evade it (oh, oh-oh)--I know I got a problem (oh, oh-oh)--Problem with misbehavin' (oh, oh-oh)--If you fall for me--I'm not easy to please--I might tear you apart--Told you from the start, baby from the start--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--Whoa, oh--Whoa, oh--Whoa, oh--Whoa, oh--Ay, and I know karma's gonna get me back for being so cold (ay)--Like a big bad wolf, I'm born to be bad and bad to the bone (ay)--If you fall for me, I'm only gonna tear you apart (ay)--Told you from the start (ay)--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--I'm only gonna break, break your, break, break your heart--Whoa, oh--Whoa, oh--Whoa, oh--"},
    { "id" : 8, "songs" : "I Like It ", "singer" : "Enrique Iglesias Featuring Pitbull", "lyrics": "[Pitbull]--One life, one love--Enrique Iglesias, Pitbull--Ya'll know what time it is.--We gon' set it off tonight, just go--Set the club on fire, just go--Enrique! Holla at them like----[Enrique]--Girl please excuse me if I'm coming too strong--But tonight is the night we can really let it go--My girlfriend's out of town and I'm all alone--Your boyfriend's on vacation and he doesn't have to know----No oh oh, oh oh--No one can do the things I'm gonna wanna do to you--No oh oh, oh oh--Shout aloud, scream aloud--Let me hear you go!----[Chorus]--Baby I like it--The way you move on the floor--Baby I like it--Come on and give me some more--Oh yes I like it--Screaming like never before--Baby I like it--I, I, I like it.----[Lionel Richie]--Party, karamu, fiesta, forever----[Enrique]--Girl please excuse me if I'm misbehaving, oh--I'm tryna keep my hands off but you're begging me for more--Round round round give a low low low--Let the time time pass 'cause we're never getting old----No oh oh, oh oh--No one can do it better turn around I'll give you more--No oh oh, oh oh--Shout aloud, scream aloud--Let me hear you go!----[Chorus]--Baby I like it--The way you move on the floor--Baby I like it--Come on and give me some more--Oh yes I like it--Screaming like never before--Baby I like it--I, I, I like it.----[Pitbull]--Go DJ. That's my DJ.--I'm a Miami boy. You know how we play--I ain't playing with you but I wanna play with you--Give me got me good.--Now watch me.----It's a different species,--Get me in DC--Let's party on the White House lawn--Tiger Woods plus Jesse James equals Pitbull all night long--Wake up Barack and Michelle, let 'em know that it's on----Pa' fuera! Pa' la calle!--Dale mamita tirame ese baile!--Dale mamita tirame ese baile!----I see you watching me,--You see me watchin' you--I love the way you move--I like them things you do like.----[Enrique]--Don't stop baby, don't stop baby--Just keep on shaking along--I won't stop baby, won't stop baby--Until you get enough----[Lionel Richie]--Party, karamu, fiesta, forever----[Chorus]--Baby I like it!--The way you move on the floor--Baby I like it!--Come on and give me some more!--Oh yes I like it!--Screaming like never before--Baby I like it!--I, I, I like it!----Baby I like it!--The way you move on the floor--Baby I like it!--Come on and give me some more!--Oh yes I like it!--Screaming like never before--Baby I like it!--I, I, I like it!----Party (oh yes I like it!) karamu, fiesta, forever!--Oh yes I like it!--Party, karamu (oh yes I like it!) fiesta, forever!"},
    { "id" : 9, "songs" : " Love The Way You Lie ", "singer" : "Eminem Featuring Rihanna", "lyrics": "[Rihanna:]--Just gonna stand there and watch me burn--Well, that's alright because I like the way it hurts--Just gonna stand there and hear me cry--Well, that's alright because I love the way you lie--I love the way you lie----[Eminem:]--I can't tell you what it really is--I can only tell you what it feels like--And right now, it's a steel knife in my windpipe--I can't breathe but I still fight while I can fight--As long as the wrong feels right it's like I'm in flight--High off her love, drunk from her hate--It's like I'm huffing paint and I love her the more I suffer, I suffocate--And right before I'm about to drown, she resuscitates me--She fucking hates me and I love it-- Wait! Where you going?-- I'm leaving you!--No you ain't. Come back--We're running right back--Here we go again--It's so insane 'cause when it's going good, it's going great--I'm Superman with the wind at his back, she's Lois Lane--But when it's bad it's awful, I feel so ashamed I snap--Who's that dude?--I don't even know his name--I laid hands on her, I'll never stoop so low again--I guess I don't know my own strength----[Rihanna:]--Just gonna stand there and watch me burn--Well, that's alright because I like the way it hurts--Just gonna stand there and hear me cry--Well, that's alright because I love the way you lie--I love the way you lie--I love the way you lie----[Eminem:]--You ever love somebody so much you can barely breathe when you're with 'em--You meet and neither one of you even know what hit 'em--Got that warm fuzzy feeling--Yeah, them chills used to get 'em--Now you're getting fucking sick of looking at 'em--You swore you'd never hit 'em; never do nothing to hurt 'em--Now you're in each other's face spewing venom in your words when you spit them--You push, pull each other's hair, scratch, claw, bit 'em--Throw 'em down, pin 'em--So lost in the moments when you're in them--It's the rage that took over--It controls you both--So they say it's best to go your separate ways--Guess that they don't know you 'cause today that was yesterday--Yesterday is over, it's a different day--Sound like broken records playing over but you promised her--Next time you'd show restraint--You don't get another chance--Life is no Nintendo game--But you lied again--Now you get to watch her leave out the window--Guess that's why they call it window pane----[Rihanna:]--Just gonna stand there and watch me burn--Well, that's alright because I like the way it hurts--Just gonna stand there and hear me cry--Well, that's alright because I love the way you lie--I love the way you lie--I love the way you lie----[Eminem:]--Now I know we said things, did things that we didn't mean--And we fall back into the same patterns, same routines--But your temper's just as bad as mine is--You're the same as me--When it comes to love you're just as blinded--Baby, please come back--It wasn't you, baby it was me--Maybe our relationship isn't as crazy as it seems--Maybe that's what happens when a tornado meets a volcano--All I know is I love you too much to walk away though--Come inside, pick up your bags off the sidewalk--Don't you hear sincerity in my voice when I talk--Told you this is my fault--Look me in the eyeball--Next time I'm pissed, I'll aim my fist at the drywall--Next time? There won't be no next time!--I apologize even though I know it's lies--I'm tired of the games I just want her back--I know I'm a liar--If she ever tries to fucking leave again--I'mma tie her to the bed and set this house on fire--I'm just gonna----[Rihanna:]--Just gonna stand there and watch me burn--Well, that's alright because I like the way it hurts--Just gonna stand there and hear me cry--Well, that's alright because I love the way you lie--I love the way you lie--I love the way you lie"},
    { "id" : 10, "songs" : "Cooler Than Me", "singer" : "Mike Posner", "lyrics": "--If I could write you a song to make you fall in love--I would already have you up under my arm--I used up all my tricks, I hope that you like this--But, you probably won't, you think you're cooler than me--You got designer shades just to hide your face--And you wear 'em around like you're cooler than me--And you never say hey, or remember my name--And it's probably 'cause you think you're cooler than me--You got your high brow, shoes on your feet--And you wear 'em around like it ain't shit--But you don't know the way that you look--When your steps make that much noise--Shh, I got you all figured out--You need everyone's eyes just to feel seen--Behind your make up nobody knows who you even are--Who do you think that you are--If I could write you a song to make you fall in love--I would already have you up under my arm--I used up all my tricks, I hope that you like this--But, you probably won't, you think you're cooler than me--You got designer shades just to hide your face--And you wear 'em around like you're cooler than me--And you never say hey, or remember my name--And it's probably 'cause you think you're cooler than me--You got your high brow, switchin' your walk--And you don't even look when you pass by--But you don't know the way that you look--When your steps make that much noise--Shh, I got you all figured out--You need everyone's eyes just to feel seen--Behind your make up nobody knows who you even are--Who do you think that you are--'Cause it's your scene, (it's your scene)--I got no doubt--We all see--You got your head in the clouds--If I could write you a song to make you fall in love--I would already have you up under my arm--I used up all my tricks, I hope that you like this--But, you probably won't, you think you're cooler than me--You got designer shades just to hide your face--And you wear 'em around like you're cooler than me--And you never say hey, or remember my name--And it's probably 'cause you think you're cooler than me--"}
    
    ]
  
  


     
    