[
    { "id" : 1, "songs" : "Blurred Lines ", "singer" : " Robin Thicke Featuring T.I. + Pharrell ", "lyrics":  "--Everybody, get up--Everybody, get up (hey, hey, hey)--Hey, hey, hey--Hey, hey, hey--(Turn it up)--If you can't hear what I'm trying to say--If you can't read from the same page--Maybe I'm going deaf (hey, hey, hey)--Maybe I'm going blind (hey, hey, hey)--Maybe I'm out my mind (hey, hey, hey)--Okay, now he was close--Tried to domesticate you--But you're an animal--Baby, it's in your nature (meow)--Just let me liberate you (hey, hey, hey)--You don't need no papers (hey, hey, hey)--That man is not your maker (hey, hey, hey)--And that's why I'm gon' take a--Good girl--I know you want it--I know you want it--I know you want it--You're a good girl--Can't let it get past me--You're far from plastic--Talk about getting blasted--I hate these blurred lines--I know you want it--I know you want it--I know you want it--But you're a good girl--The way you grab me--Must wanna get nasty--Go ahead, get at me--What do they make dreams for when you got them jeans on?--What do we need steam for?--You the hottest bitch in this place--I feel so lucky (hey, hey, hey)--You wanna hug me (hey, hey, hey)--What rhymes with hug me? (hey, hey, hey)--Hey! (Everybody, get up)--Okay, now he was close--Tried to domesticate you--But you're an animal--Baby, it's in your nature--Just let me liberate you (hey, hey, hey)--You don't need no papers (hey, hey, hey)--That man is not your maker (hey, hey, hey)--And that's why I'm gon' take a--Good girl--I know you want it--I know you want it--I know you want it--You're a good girl--Can't let it get past me--You're far from plastic--Talk about getting blasted--I hate these blurred lines (I hate them lines)--I know you want it (I hate them lines)--I know you want it (I hate them lines)--I know you want it--But you're a good girl--The way you grab me--Must wanna get nasty--Go ahead, get at me--One thing I ask of you--Let me be the one you back that ass up to (come on)--Go, from Malibu to Paris, boo--Yeah, had a bitch, but she ain't bad as you--So, hit me up when you pass through--I'll give you something big enough to tear your ass in two--Swag on 'em even when you dress casual--I mean, it's almost unbearable--In a hundred years not dare, would I?--Pull a Pharcyde, let you pass me by--Nothing like your last guy, he too square for you--He don't smack that ass and pull your hair for you (you like it)--So I'm just watching and waiting--For you to salute the truly pimping--Not many women can refuse this pimping--I'm a nice guy, but don't get confused, this pimping--Shake your rump--Get down, get up-a--Do it like it hurt, like it hurt--What you don't like work?--Hey! (Everybody, get up)--Baby, can you breathe?--I got this from Jamaica--It always works for me--Dakota to Decatur--No more pretending (hey, hey, hey)--'Cause now you winning (hey, hey, hey)--Here's our beginning (hey, hey, hey)--I always wanted a--Good girl--I know you want it--I know you want it--I know you want it--You're a good girl--Can't let it get past me--You're far from plastic--Talk about getting blasted--I hate these blurred lines--I know you want it--I know you want it--I know you want it--But you're a good girl--The way you grab me--Must wanna get nasty--Go ahead, get at me--Everybody, get up--Everybody, get up--Hey, hey, hey--"},
    { "id" : 2, "songs" : " Locked Out Of Heaven ", "singer" : " Bruno Mars ", "lyrics": "One, two, one, two, three----    Oh, yeah, yeah,--    Oh, yeah, yeah, yeah, yeah,--    Ooh!--    Oh, yeah, yeah,--    Oh, yeah, yeah, yeah, yeah,--    Ooh!--    --    Never had much faith in love or miracles--    Ooh!--    Never wanna put my heart on the line--    Ooh!--    But swimming in your water is something spiritual--    Ooh!--    I'm born again every time you spend the night--    Ooh!--    --    'Cause your sex takes me to paradise--    Yeah, your sex takes me to paradise--    And it shows, yeah, yeah, yeah--    --    'Cause you make me feel like I've been locked out of heaven--    For too long, for too long--    Yeah, you make me feel like I've been locked out of heaven--    For too long, for too long--    --    Oh, yeah, yeah, yeah, yeah,--    Ooh!--    Oh, yeah, yeah,--    Oh, yeah, yeah, yeah, yeah,--    Ooh!--    --    You bring me to my knees, you make me testify--    You can make a sinner change his ways--    Open up your gates 'cause I can't wait to see the light--    And right there is where I wanna stay--    --    'Cause your sex takes me to paradise--    Yeah, your sex takes me to paradise--    And it shows, yeah, yeah, yeah--    --    'Cause you make me feel like I've been locked out of heaven--    For too long, for too long--    Yeah, you make me feel like I've been locked out of heaven--    For too long, for too long--    --    Oh, oh, oh, oh, yeah, yeah, yeah--    Can I just stay here?--    Spend the rest of my days here?--    Oh, oh, oh, oh, yeah, yeah, yeah--    Can I just stay here?--    Spend the rest of my days here?--    --    'Cause you make me feel like I've been locked out of heaven--    For too long, for too long--    Yeah, you make me feel like I've been locked out of heaven--    For too long, for too long--    --    Oh, yeah, yeah, yeah, yeah,--    Ooh!--    Oh, yeah, yeah,--    Oh, yeah, yeah, yeah, yeah,--    Ooh!--    "  },  
    { "id" : 3, "songs" : " I Knew You Were Trouble. ", "singer" : " Taylor Swift ", "lyrics": " [Music video spoken part:]--    I think - I think when it's all over,--    It just comes back in flashes, you know?--    It's like a kaleidoscope of memories.--    It just all comes back. But he never does.--    I think part of me knew the second I saw him that this would happen.--    It's not really anything he said or anything he did,--    It was the feeling that came along with it.--    And the crazy thing is I don't know if I'm ever gonna feel that way again.--    But I don't know if I should.--    I knew his world moved too fast and burned too bright.--    But I just thought, how can the devil be pulling you toward someone who looks so much like an angel when he smiles at you?--    Maybe he knew that when he saw me.--    I guess I just lost my balance.--    I think that the worst part of it all wasn't losing him.--    It was losing me.--    --    Once upon a time, a few mistakes ago--    I was in your sights, you got me alone--    You found me, you found me, you found me--    I guess you didn't care, and I guess I liked that--    And when I fell hard you took a step back--    Without me, without me, without me--    --    And he's long gone when he's next to me--    And I realize the blame is on me--    --    'Cause I knew you were trouble when you walked in--    So shame on me now--    Flew me to places I'd never been--    'Til you put me down, oh--    I knew you were trouble when you walked in--    So shame on me now--    Flew me to places I'd never been--    Now I'm lying on the cold hard ground--    Oh, oh, trouble, trouble, trouble--    Oh, oh, trouble, trouble, trouble--    --    No apologies. He'll never see you cry,--    Pretends he doesn't know that he's the reason why--    You're drowning, you're drowning, you're drowning--    Now I heard you moved on from whispers on the street--    A new notch in your belt is all I'll ever be--    And now I see, now I see, now I see--    --    He was long gone when he met me--    And I realize the joke is on me, yeah!--    --    I knew you were trouble when you walked in--    So shame on me now--    Flew me to places I'd never been--    'Til you put me down, oh--    I knew you were trouble when you walked in--    So shame on me now--    Flew me to places I'd never been--    Now I'm lying on the cold hard ground--    Oh, oh, trouble, trouble, trouble--    Oh, oh, trouble, trouble, trouble--    --    And the saddest fear comes creeping in--    That you never loved me or her, or anyone, or anything, yeah--    --    I knew you were trouble when you walked in--    So shame on me now--    Flew me to places I'd never been--    'Til you put me down, oh--    I knew you were trouble when you walked in (you were right there, you were right there)--    So shame on me now--    Flew me to places I'd never been--    Now I'm lying on the cold hard ground--    Oh, oh, trouble, trouble, trouble--    Oh, oh, trouble, trouble, trouble--    --    I knew you were trouble when you walked in--    Trouble, trouble, trouble--    I knew you were trouble when you walked in--    Trouble, trouble, trouble--    --    [Music video spoken part:]--    I don't know if you know who you are until you lose who you are."    },
    { "id" : 4, "songs" : " Can't Hold Us ", "singer" : " Macklemore & Ryan Lewis Featuring Ray Dalton ", "lyrics": "Ay, ay, ay--    Good to see you, come on in, let's go--    Yeah, let's go--    Alright, alright--    OK, uh, alright, OK--    Alright, OK--    --    Return of the Mack, get up!--    What it is, what it does, what it is, what it isn't.--    Looking for a better way to get up out of bed--    Instead of getting on the Internet and checking a new hit me.--    --    Get up! Thrift shop, pimp-strut walking, little bit of humble, little bit of cautious--    Somewhere between like Rocky and Cosby. Sweater game, nope, nope y'all can't copy--    --    Yup. Bad, moon-walking, this here is our party, my posse's been on Broadway,--    And we did it our way.--    Grown music, I shed my skin and put my bones into everything I record to it--    And yet I'm on...--    --    Let that stage light go and shine on down,--    Got that Bob Barker suit game and Plinko in my style.--    --    Money, stay on my craft and stick around for those pounds,--    But I do that to pass the torch and put on for my town--    --    Trust me. On my I-N-D-E-P-E-N-D-E-N-T shit, hustling,--    Chasing dreams since I was fourteen with the four track bussing--    Halfway cross that city with the backpack, fat cat, crush shit.--    --    Labels out here,--    Nah, they can't tell me nothing--    We give that to the people,--    Spread it across the country--    Labels out here,--    Nah, they can't tell me nothing--    We give it to the people,--    Spread it across the country--    --    Can we go back? This is the moment--    Tonight is the night, we'll fight 'til it's over--    So we put our hands up like the ceiling can't hold us--    Like the ceiling can't hold us--    --    Can we go back? This is the moment--    Tonight is the night, we'll fight 'til it's over--    So we put our hands up like the ceiling can't hold us--    Like the ceiling can't hold us--    --    Nah, can I kick it? Thank you. Yeah I'm so damn grateful.--    I grew up, really wanted gold fronts--    But that's what you get when Wu-Tang raised you--    --    Y'all can't stop me, go hard like I got an 808 in my heart beat--    And I'm eating at the beat like you give a little speed to a great white shark on shark week--    --    Raw. Tell me go up. Gone!--    Deuces goodbye. I got a world to see, and my girl she wanna see Rome,--    Caesar'll make you a believer.--    --    Nah I never ever did it for a throne.--    That validation comes from giving it back to the people.--    Nah sing this song and it goes like--    --    Raise those hands, this is our party--    We came here to live life like nobody was watching--    I got my city right behind me--    If I fall, they got me.--    Learn from that failure gain humility and then we keep marching. I said...--    --    Can we go back? This is the moment--    Tonight is the night, we'll fight 'til it's over--    So we put our hands up like the ceiling can't hold us--    Like the ceiling can't hold us--    --    Can we go back? This is the moment--    Tonight is the night, we'll fight 'til it's over--    So we put our hands up like the ceiling can't hold us--    Like the ceiling can't hold us--    --    And so we put our hands up--    And so we put our hands up--    --    Wa oh oh oh wa oh oh oh wa oh oh--    Let's go!--    --    Na na na na na na na na (aha)--    Hey--    And all my people say--    --    Na na na na na na na na (that's right, feels good)--    Hey--    And all my people say--    --    Na na na na na na na na (it's alright)--    (Oh oh oh oh oh oh oh oh)--    And all my people say--    --    Na na na na na na na na--    Mack-le-le-le-le-le-more...--    --    [Album version ending:]--    Can we go back? This is the moment--    Tonight is the night, we'll fight 'til it's over--    So we put our hands up like the ceiling can't hold us--    Like the ceiling can't hold us--    Can we go back? This is the moment--    Tonight is the night, we'll fight 'til it's over--    So we put our hands up like the ceiling can't hold us--    Like the ceiling can't hold us.--    --    [Music video ending:]--    Let the night come, before the fight's won--    Some might run against the test--    But those that triumph, embrace the fight 'cause--    Their fears then prove that courage exists (c'mon)--    Let the night come, before the fight's won--    Some might run against the test--    But those that triumph, embrace the fight 'cause--    Their fears then prove that courage exists--    --    Hope [echo]" },
    { "id" : 5, "songs" : " Clarity ", "singer" : " Zedd Featuring Foxes ", "lyrics": "--High dive into frozen waves where the past comes back to life--Fight fear for the selfish pain, it was worth it every time--Hold still right before we crash 'cause we both know how this ends--A clock ticks 'til it breaks your glass and I drown in you again----'Cause you are the piece of me I wish I didn't need--Chasing relentlessly, still fight and I don't know why----If our love is tragedy, why are you my remedy?--If our love's insanity, why are you my clarity?----(Hey-ay, hey-ay-ay. Hey-ay, hey-ay-ay. Hey-ay, hey-ay-ay. Hey-ay, hey)----If our love is tragedy, why are you my remedy?--If our love's insanity, why are you my clarity?----Walk on through a red parade and refuse to make amends--It cuts deep through our ground and makes us forget all common sense--Don't speak as I try to leave 'cause we both know what we'll choose--If you pull then I'll push too deep and I'll fall right back to you----'Cause you are the piece of me I wish I didn't need--Chasing relentlessly, still fight and I don't know why----If our love is tragedy, why are you my remedy?--If our love's insanity, why are you my clarity?----(Hey-ay, hey-ay-ay. Hey-ay, hey-ay-ay. Hey-ay, hey-ay-ay. Hey-ay, hey)----Why are you my clarity?--Why are you my remedy?--Why are you my clarity?--Why are you my remedy?----If our love is tragedy, why are you my remedy?--If our love's insanity, why are you my clarity?--"  },
    { "id" : 6, "songs" : "Mirrors", "singer" : "Justin Timberlake ", "lyrics": "--    Aren't you somethin' to admire?--    'Cause your shine is somethin' like a mirror--    And I can't help but notice--    You reflect in this heart of mine--    If you ever feel alone and--    The glare makes me hard to find--    Just know that I'm always parallel on the other side--    --    'Cause with your hand in my hand and a pocket full of soul--    I can tell you there's no place we couldn't go--    Just put your hand on the glass--    I'm here tryin' to pull you through--    You just gotta be strong--    --    'Cause I don't wanna lose you now--    I'm lookin' right at the other half of me--    The vacancy that sat in my heart--    Is a space that now you hold--    Show me how to fight for now--    And I'll tell you, baby, it was easy--    Comin' back here to you once I figured it out--    You were right here all along--    --    It's like you're my mirror--    My mirror staring back at me--    I couldn't get any bigger--    With anyone else beside of me--    And now it's clear as this promise--    That we're making two reflections into one--    'Cause it's like you're my mirror--    My mirror staring back at me, staring back at me--    --    Aren't you somethin', an original--    'Cause it doesn't seem merely a sample--    And I can't help but stare, 'cause--    I see truth somewhere in your eyes--    I can't ever change without you--    You reflect me, I love that about you--    And if I could, I would look at us all the time--    --    'Cause with your hand in my hand and a pocket full of soul--    I can tell you there's no place we couldn't go--    Just put your hand on the glass--    I'm here tryin' to pull you through--    You just gotta be strong--    --    'Cause I don't wanna lose you now--    I'm lookin' right at the other half of me--    The vacancy that sat in my heart--    Is a space that now you hold--    Show me how to fight for now--    And I'll tell you, baby, it was easy--    Comin' back here to you once I figured it out--    You were right here all along--    --    It's like you're my mirror--    My mirror staring back at me--    I couldn't get any bigger--    With anyone else beside of me--    And now it's clear as this promise--    That we're making two reflections into one--    'Cause it's like you're my mirror--    My mirror staring back at me, staring back at me--    --    Yesterday is history--    Tomorrow's a mystery--    I can see you lookin' back at me--    Keep your eyes on me--    Baby, keep your eyes on me--    --    'Cause I don't wanna lose you now--    I'm lookin' right at the other half of me--    The vacancy that sat in my heart--    Is a space that now you hold--    Show me how to fight for now (please show me, baby)--    I'll tell you, baby, it was easy--    Comin' back here to you once I figured it out--    You were right here all along--    --    It's like you're my mirror--    My mirror staring back at me--    I couldn't get any bigger--    With anyone else beside of me--    And now it's clear as this promise--    That we're making two reflections into one--    'Cause it's like you're my mirror--    My mirror staring back at me, staring back at me--    --    You are, you are the love of my life [10x]--    --    Now you're the inspiration of this precious song--    And I just wanna see your face light up since you put me on--    So now I say goodbye to the old me, it's already gone--    And I can't wait wait wait wait wait to get you home--    Just to let you know, you are--    --    You are, you are the love of my life [8x]--    --    Girl you're my reflection, all I see is you--    My reflection, in everything I do--    You're my reflection and all I see is you--    My reflection, in everything I do--    --    You are, you are the love of my life [16x]"},
    { "id" : 7, "songs" : "Radioactive", "singer" : "Imagine Dragons ", "lyrics": "--    Whoa, oh, oh--    Whoa, oh, oh--    Whoa, oh, oh--    Whoa--    --    I'm waking up to ash and dust--    I wipe my brow and I sweat my rust--    I'm breathing in the chemicals--    [Inhale, exhale]--    --    I'm breaking in, shaping up, then checking out on the prison bus--    This is it, the apocalypse--    Whoa oh--    --    I'm waking up, I feel it in my bones--    Enough to make my system blow--    Welcome to the new age, to the new age--    Welcome to the new age, to the new age--    Whoa, oh, oh, oh, oh, whoa, oh, oh, oh, I'm radioactive, radioactive--    Whoa, oh, oh, oh, oh, whoa, oh, oh, oh, I'm radioactive, radioactive--    --    I raise my flag and dye my clothes--    It's a revolution, I suppose--    We're painted red to fit right in--    Whoa oh--    --    I'm breaking in, shaping up, then checking out on the prison bus--    This is it, the apocalypse--    Whoa oh--    --    I'm waking up, I feel it in my bones--    Enough to make my system blow--    Welcome to the new age, to the new age--    Welcome to the new age, to the new age--    Whoa, oh, oh, oh, oh, whoa, oh, oh, oh, I'm radioactive, radioactive--    Whoa, oh, oh, oh, oh, whoa, oh, oh, oh, I'm radioactive, radioactive--    --    All systems go, the sun hasn't died--    Deep in my bones, straight from inside--    --    I'm waking up, I feel it in my bones--    Enough to make my system blow--    Welcome to the new age, to the new age--    Welcome to the new age, to the new age--    Whoa, oh, oh, oh, oh, whoa, oh, oh, oh, I'm radioactive, radioactive--    Whoa, oh, oh, oh, oh, whoa, oh, oh, oh, I'm radioactive, radioactive--    "},
    { "id" : 8, "songs" : "Don't You Worry Child ", "singer" : "Swedish House Mafia Featuring John Martin ", "lyrics": "--    There was a time, I used to look into my father's eyes--    In a happy home, I was a king I had a golden throne--    Those days are gone, now ﻿the memories are on the wall--    I hear the sounds from the places where I was born--    Up on the hill across the blue lake--    That's where I had my first heart break--    I still remember how it all changed--    My father said--    Don't you worry, don't you worry child--    See heaven's got a plan for you--    Don't you worry, don't you worry now, yeah--    Don't you worry, don't you worry child--    See heaven's got a plan for you--    Don't you worry, don't you worry now, yeah--    There was a time, I met a girl of a different kind--    We ruled the world,--    Thought I'll never lose her out of sight--    We were so young--    I think of her now and then--    I still hear the songs, reminding me of a friend--    Up on the hill across the blue lake--    That's where I had my first heart break--    I still remember how it all changed--    My father said--    Don't you worry, don't you worry child--    See heaven's got a plan for you--    Don't you worry, don't you worry now, yeah--    Ooh, ooh, ooh, ooh--    Ooh, ooh, ooh, ooh--    Ooh, ooh, ooh, ooh--    See heaven's got a plan for you--    Don't you worry, don't you worry child--    See heaven's got a plan for you--    Don't you worry, don't you worry now, yeah--    Ooh, ooh, ooh, ooh--    Ooh, ooh, ooh, ooh--    Ooh, ooh, ooh, ooh, yeah--    "},
    { "id" : 9, "songs" : "Thrift Shop ", "singer" : "Macklemore & Ryan Lewis Featuring Wanz", "lyrics": "--Hey, Macklemore! Can we go thrift shopping?----What, what, what, what... [8x]----Bada, bada, badadada [8x]----I'm gonna pop some tags--Only got twenty dollars in my pocket--I - I - I'm hunting, looking for a come-up--This is fucking awesome----Nah, walk up to the club like, What up? I got a big cock!--I'm so pumped about some shit from the thrift shop--Ice on the fringe, it's so damn frosty--That people like, Damn! That's a cold ass honkey.--Rollin' in, hella deep, headin' to the mezzanine,--Dressed in all pink, 'cept my gator shoes, those are green--Draped in a leopard mink, girls standin' next to me--Probably shoulda washed this, smells like R. Kelly's sheets--Piiisssssss--But—shit—it was ninety-nine cents! Bag it--Coppin' it, washin' it, 'bout to go and get some compliments--Passin' up on those moccasins someone else's been walkin' in--Bummy and grungy, fuck it, man--I am stuntin' and flossin' and--Savin' my money and I'm hella happy that's a bargain, bitch--I'm a take your grandpa's style, I'm a take your grandpa's style,--No, for real. Ask your grandpa. Can I have his hand-me-downs? Thank you--Velour jumpsuit and some house slippers--Dookie brown leather jacket that I found diggin'--They had a broken keyboard, I bought a broken keyboard--I bought a skeet blanket, then I bought a kneeboard--Hello, hello, my ace man, my Mello--John Wayne ain't got nothing on my fringe game, hell no--I could take some Pro Wings, make them cool, sell those--The sneaker heads would be like Aw, he got the Velcros----[2x]--I'm gonna pop some tags--Only got twenty dollars in my pocket--I - I - I'm hunting, looking for a come-up--This is fucking awesome----What you know about rockin' a wolf on your noggin?--What you knowin' about wearin' a fur fox skin?--I'm digging, I'm digging, I'm searching right through that luggage--One man's trash, that's another man's come-up--Thank your granddad for donating that plaid button-up shirt--'Cause right now I'm up in her skirt--I'm at the Goodwill, you can find me in the Uptons--I'm not, I'm not stuck, I'm searchin' in that section Uptons--Your grammy, your aunty, your momma, your mammy--I'll take those flannel zebra jammies, second-hand, I rock that motherfucker--The built-in onesie with the socks on that motherfucker--I hit the party and they stop in that motherfucker--They be like, Oh, that Gucci. That's hella tight.--I'm like, Yo, that's fifty dollars for a T-shirt.--Limited edition, let's do some simple addition--Fifty dollars for a T-shirt - that's just some ignorant bitch. Shit--I call that getting swindled and pimped. Shit--I call that getting tricked by a business--That shirt's hella dough--And having the same one as six other people in this club is a hella don't--Peep game, come take a look through my telescope--Tryna get girls from a brand and you hella won't--Man you hella won't----Goodwill... poppin' tags... yeah!----I'm gonna pop some tags--Only got twenty dollars in my pocket--I - I - I'm hunting, looking for a come-up--This is fucking awesome----I wear your granddad's clothes--I look incredible--I'm in this big ass coat--From that thrift shop down the road--I wear your granddad's clothes, damn right--I look incredible, now come on, man--I'm in this big ass coat, big ass coat--From that thrift shop down the road. Let's go----I'm gonna pop some tags--Only got twenty dollars in my pocket--I - I - I'm hunting, looking for a come-up--This is fucking awesome----Is that your grandma's coat?"},
    { "id" : 10, "songs" : "Daylight", "singer" : "Maroon 5", "lyrics": "--    Here I am waiting--    I'll have to leave soon--    Why am I holding on?--    We knew this day would come--    We knew it all along--    How did it come so fast?--    --    This is our last night but it's late--    And I'm trying not to sleep--    'Cause I know, when I wake, I will have to slip away--    --    And when the daylight comes I'll have to go--    But tonight I'm gonna hold you so close--    'Cause in the daylight we'll be on our own--    But tonight I need to hold you so close--    --    Here I am staring--    At your perfection--    In my arms, so beautiful--    The sky is getting bright,--    The stars are burning out--    Somebody slow it down--    --    This is way too hard, 'cause I know--    When the sun comes up I will leave--    This is my last glance that will soon be a memory--    --    And when the daylight comes I'll have to go--    But tonight I'm gonna hold you so close--    'Cause in the daylight we'll be on our own--    But tonight I need to hold you so close--    --    I never want it to stop--    Because I don't wanna start all over--    Start all over--    I was afraid of the dark--    But now it's all that I want--    All that I want, all that I want--    --    And when the daylight comes I'll have to go--    But tonight I'm gonna hold you so close--    'Cause in the daylight we'll be on our own--    But tonight I need to hold you so close--    --    And when the daylight comes I'll have to go--    But tonight I'm gonna hold you so close--    'Cause in the daylight we'll be on our own--    But tonight I need to hold you so close"}
              
  ]