
[
    { "id" : 1, "songs" : "Blurred Lines ", "singer" : " Robin Thicke Featuring T.I. + Pharrell ", "lyrics": " Everybody get up (Hey, hey, hey) Hey, hey, hey Hey, hey, hey Hey, hey, hey If you can't hear what I'm trying to say If you can't read from the same page Maybe I'm going deaf Maybe I'm going blind Maybe I'm out of my mind Everybody get up OK now he was close, tried to domesticate you But you're an animal, baby, it's in your nature Just let me liberate you Hey, hey, hey You don't need no papers Hey, hey, hey That man is not your maker And that's why I'm gon' take a good girl I know you want it I know you want it I know you want it You're a good girl Can't let it get past me You're far from plastic Talk about getting blasted I hate these blurred lines I know you want it I know you want it I know you want it But you're a good girl The way you grab me Must wanna get nasty Go ahead, get at me Everybody get up What do they make dreams for When you got them jeans on What do we need steam for You the hottest bitch in this place I feel so lucky Hey, hey, hey You wanna hug me Hey, hey, hey What rhymes with hug me? Hey, hey, hey OK now he was close, tried to domesticate you But you're an animal, baby it's in your nature Just let me liberate you Hey, hey, hey You don't need no papers Hey, hey, hey That man is not your maker Hey, hey, hey And that's why I'm gon' take a good girl I know you want it I know you want it I know you want it You're a good girl Can't let it get past me You're far from plastic Talk about getting blasted Everybody get up I hate these blurred lines I know you want it I hate them lines I know you want it I hate them lines I know you want it But you're a good girl The way you grab me Must wanna get nasty Go ahead, get at me Shake around, get down, get up Do it like it hurt, like it hurt What you don't like work? Everybody get up Baby can you breathe? I got this from Jamaica It always works for me, Dakota to Decatur, uh huh No more pretending Hey, hey, hey 'Cause now you winning Hey, hey, hey Here's our beginning I always wanted a good girl I know you want it I know you want it I know you want it You're a good girl Can't let it get past me You're far from plastic Talk about getting blasted I hate these blurred lines (Everybody get up) I know you want it I know you want it I know you want it But you're a good girl The way you grab me Must wanna get nasty Go ahead, get at me Everybody get up Everybody get up Everybody get up Everybody get up "
    },
    { "id" : 2, "songs" : " Locked Out Of Heaven ", "singer" : " Bruno Mars ", "lyrics": "One, two, one, two, three Oh yeah yeah Oh yeah yeah yeah yeah, uh! Oh yeah yeah Oh yeah yeah yeah yeah, uh! Never had much faith in love or miracles (miracles) uh! Never wanna put my heart on the line, uh! But swimming in your water is something spiritual (spiritual) uh! I'm born again every time you spend the night, uh! 'Cause your sex takes me to paradise Yeah your sex takes me to paradise And it shows, yeah, yeah, yeah 'Cause you make me feel like, I've been locked out of Heaven For too long, for too long Yeah you make me feel like, I've been locked out of Heaven For too long, for too long Oh yeah yeah yeah yeah, uh! Oh yeah yeah Oh yeah yeah yeah yeah, uh! You bring me to my knees You make me testify, uh! You can make a sinner change his ways, uh! Open up your gates 'cause I can't wait to see the light, uh! And right there is where I wanna stay, uh! 'Cause your sex takes me to paradise Yeah your sex takes me to paradise And it shows, yeah, yeah, yeah 'Cause you make me feel like, I've been locked out of Heaven For too long, for too long Yeah you make me feel like, I've been locked out of Heaven For too long, for too long Oh oh oh oh, yeah, yeah, yeah Can I just stay here? Spend the rest of my days here? Oh oh oh oh, yeah, yeah, yeah Can't I just stay here? Spend the rest of my days here? 'Cause you make me feel like, I've been locked out of Heaven For too long, for too long Yeah you make me feel like, I've been locked out of Heaven For too long, for too long Oh yeah yeah yeah yeah, uh! Oh yeah yeah Oh yeah yeah yeah yeah, uh"
    }, 
    { "id" : 3, "songs" : " I Knew You Were Trouble. ", "singer" : " Taylor Swift ", "lyrics": " A few mistakes ago I was in your sights You got me alone You found me You found me You found me I guess you didn't care And I guess I liked that And when I fell hard You took a step back Without me Without me Without me And he's long gone When he's next to me And I realize The blame is on me 'Cause I knew you were trouble when you walked in So shame on me now Flew me to places I'd never been 'Til you put me down, oh I knew you were trouble when you walked in So, shame on me now Flew me to places I'd never been Now I'm lyin' on the cold hard ground Oh, oh Trouble, trouble, trouble Oh, oh Trouble, trouble, trouble No apologies He'll never see you cry Pretend he doesn't know That he's the reason why You're drowning You're drowning You're drowning And I heard you moved on From whispers on the street A new notch in your belt Is all I'll ever be And now I see Now I see Now I see He was long gone When he met me And I realize The joke is on me, hey I knew you were trouble when you walked in, oh-ooh So shame on me now Flew me to places I'd never been Till you put me down, oh I knew you were trouble when you walked in So shame on me now Flew me to places I'd never been, yeah Now I'm lyin' on the cold hard ground Oh, oh (yeah) Trouble, trouble, trouble Oh, oh Trouble, trouble, trouble And the saddest fear Comes creepin' in That you never loved me Or her Or anyone Or anything Yeah I knew you were trouble when you walked in So shame on me now Flew me to places I'd never been (never been) Till you put me down, oh I knew you were trouble when you walked in (knew it right there, knew it right there) So shame on me now Flew me to places I'd never been (Uuh) now I'm lyin' on the cold hard ground Oh, oh Trouble, trouble, trouble, oh Oh, oh Trouble, trouble, trouble I knew you were trouble when you walked in Trouble, trouble, trouble I knew you were trouble when you walked in "
    },
    { "id" : 4, "songs" : " Can't Hold Us ", "singer" : " Macklemore & Ryan Lewis Featuring Ray Dalton ", "lyrics": " Good to see you, c'mon let's go Yeah, let's go Alright, alright, okay, ah, alright, okay Alright, okay Return of the Mack', get up, what it is, what it does, what it is, what it isn't Looking for a better way to get up out of bed Instead of getting on the internet and checking a new hit We get up, fresh out, pimp strut walking Little bit of humble, little bit of cautious Somewhere between like, Rocky and Cosby, sweater game Nope, nope, y'all can't copy that Bad, moonwalkin', this here, is our party My posse's been on Broadway, and we did it our way, grown music I shed my skin and put my bones into everything, I record to it And yet I'm on, let that stage light go and shine on down Got the Bob Barker suit game and Plinko in my style Money Stay on my craft and stick around for those pounds But I do that to pass the torch and put on for my town Trust me, on my I-N-D-E-P-E-N-D-E-N-T shit hustling Chasing dreams since I was fourteen With the fourtrack, bussin' Halfway cross that city with the backpack, fat cat, crush shit Labels out here, nah, they can't tell me nothin' We give that to the people, spread it across the country Labels out here, nah, they can't tell me nothin' We give it to the people, spread it across the country Can we go back, this is the moment Tonight is the night, we'll fight till it's over So we put our hands up like the ceiling can't hold us Like the ceiling can't hold us Can we go back, this is the moment Tonight is the night, we'll fight till it's over So we put our hands up like the ceiling can't hold us Like the ceiling can't hold us Now, can I kick it? Thank you Yeah, I'm so damn grateful I grew up really wanting gold fronts But that's what you get when Wu-Tang raised you Y'all can't stop me, go hard like I've got an 808 in my heart beat And I'm meeting at the beat like you gave a little speed To a great white shark on shark week, raw Tell me go up, gone Gone! Deuces, goodbye, I've got a world to see And my girl, she wanna see Rome Caesar make you a believer, nah I never ever did it for a throne That validation comes, so I'm giving it back to the people now Sing that song and it goes like Raise those hands, this is our party We came here to live life like nobody was watching I got my city right behind me If I fall they got me Learn from that failure, gain humility And then we keep marching, I said Can we go back, this is the moment Tonight is the night, we'll fight 'til it's over So we put our hands up like the ceiling can't hold us Like the ceiling can't hold us Can we go back, this is the moment Tonight is the night, we'll fight 'til it's over So we put our hands up like the ceiling can't hold us Like the ceiling can't hold us So we put our hands up So we put our hands up Na, na, nana, na, na, nana, na Aha, hey And all my people say Na, na, nana, na, na, nana, na (that's right, feels good) And all my people say Na, na, nana, na, na, nana, na Oh oh oh oh oh oh oh oh oh oh And all my people say Na, na, nana, na, na, nana, na Mack-le-eh-eh-eh-eh-more Can we go back, this is the moment Tonight is the night, we'll fight 'til it's over So we put our hands up like the ceiling can't hold us Like the ceiling can't hold us Can we go back, this is the moment Tonight is the night, we'll fight 'til it's over So we put our hands up like the ceiling can't hold us Like the ceiling can't hold us "
    },
    { "id" : 5, "songs" : " Clarity ", "singer" : " Zedd Featuring Foxes ", "lyrics": "High dive into frozen waves Where the past comes back to life Fight fear for the selfish pain And it's worth it every time Hold still right before we crash 'Cause we both know how this ends Our clock ticks till it breaks your glass And I drown in you again 'Cause you are the piece of me I wish I didn't need Chasing relentlessly Still fight and I don't know why If our love is tragedy why are you my remedy If our love's insanity why are you my clarity Why are you my remedy Why are you my remedy Why are you my clarity Why are you my remedy Why are you my clarity Why are you my remedy Why are you my clarity "
    }
]
  
