
[
  { "id" : 1, "songs" : "Thrift Shop", "singer" : "Macklemore & Ryan Lewis Featuring Wanz ", "lyrics": "--Hey, Macklemore, can we go thrift shopping?--What? What? What? What?--What? What? What? What?--What? What? What? What?--What? What? What? What?--What? What? What? What?--What? What? What? What?--What? What? What? What?--What? What? What? What?--I'm gonna pop some tags--Only got twenty dollars in my pocket--I'm, I'm, I'm hunting, looking for a come up--This is fucking awesome.--Walk into the club like What up? I got a big cock!--Nah, I'm just pumped, bought some shit from a thrift shop--Ice on the fringe is so damn frosty--People like Damn, that's a cold ass honky!--Rolling in hella deep, headed to the mezzanine--Dressed in all pink except my gator shoes, those are green--Draped in a leopard mink, girl standing next to me--Probably shoulda washed this, smells like R. Kelly's sheets (Pisssssss)--But shit, it was ninety-nine cents!--Bag it, copping it, washing it, 'bout to go and get some compliments--Passing up on those moccasins someone else been has walking in--Bummy and grudgy, fucking it, I am stunting and flossing and--Saving my money and I'm hella happy, that's a bargain bitch--Imma take your grandpa's style--Imma take your grandpa's style--No for real, ask your grandpa--Can I have his hand-me-downs? (Thank you!)--Velour jumpsuit and some house slippers--Dookie brown leather jacket that I found, dig it--They had a broken keyboard, I bought a broken keyboard--I bought a skeet blanket, then I bought a knee board--Hello, hello, my ace man, my Mello--John Wayne ain't got nothing on my fringe game, hell no--I could take some Pro Wings, make them cool, sell those--The sneaker heads would be like Ah, he got the Velcros!--I'm gonna pop some tags--Only got twenty dollars in my pocket--I'm, I'm, I'm hunting, looking for a come up--This is fucking awesome--I'm gonna pop some tags--Only got twenty dollars in my pocket--I'm, I'm, I'm hunting, looking for a come up--This is fucking awesome--What you know about rocking a wolf on your noggin?--What you knowing about wearing a fur fox skin?--I'm digging, I'm digging, I'm searching right through that luggage--One man's trash, that's another man's come up--Thank your granddad for donating that plaid button--Up shirt, 'cause right now, I'm up in here stuntin'--I'm at the Goodwill, you can find me in the (Uptons)--I'm that, I'm that sucker searching in this section (Uptons)--Your grammy, your aunty, your momma, your mammy--I'll take those flannel zebra jammies, secondhand and rock that motherfucker--The built-in onesie with the socks on that motherfucker--I hit the party and they stop in that motherfucker--They be like Oh that Gucci, that's hella tight!--I'm like Yo, that's fifty dollars for a t-shirt!--Limited edition, let's do some simple addition--Fifty dollars for a t-shirt, that's just some ignorant bitch shit--I call that getting swindled and pimped, shit--I call that getting tricked by a business, that shirt's hella dough--And having the same one as six other people in this club is a hella don't--Peep game, come take a look through my telescope--Trying to get girls from a brand, man, you hella won't--Man, you hella won't--I'm gonna pop some tags--Only got twenty dollars in my pocket--I'm, I'm, I'm hunting, looking for a come up--This is fucking awesome--I'll wear your granddad's clothes--I look incredible--I'm in this big ass coat--From that thrift shop down the road--I wear your granddad's clothes (Damn right)--I look incredible (C'mon!)--I'm in this big ass coat (Big ass coat)--From that thrift shop down the road--I'm gonna pop some tags--Only got twenty dollars in my pocket--I'm, I'm, I'm hunting, looking for a come up--This is fucking awesome--"},
  { "id" : 2, "songs" : "Blurred Lines", "singer" : "Robin Thicke Featuring T.I. + Pharrell", "lyrics": "--Everybody, get up--Everybody, get up (hey, hey, hey)--Hey, hey, hey--Hey, hey, hey--(Turn it up)--If you can't hear what I'm trying to say--If you can't read from the same page--Maybe I'm going deaf (hey, hey, hey)--Maybe I'm going blind (hey, hey, hey)--Maybe I'm out my mind (hey, hey, hey)--Okay, now he was close--Tried to domesticate you--But you're an animal--Baby, it's in your nature (meow)--Just let me liberate you (hey, hey, hey)--You don't need no papers (hey, hey, hey)--That man is not your maker (hey, hey, hey)--And that's why I'm gon' take a--Good girl--I know you want it--I know you want it--I know you want it--You're a good girl--Can't let it get past me--You're far from plastic--Talk about getting blasted--I hate these blurred lines--I know you want it--I know you want it--I know you want it--But you're a good girl--The way you grab me--Must wanna get nasty--Go ahead, get at me--What do they make dreams for when you got them jeans on?--What do we need steam for?--You the hottest bitch in this place--I feel so lucky (hey, hey, hey)--You wanna hug me (hey, hey, hey)--What rhymes with hug me? (hey, hey, hey)--Hey! (Everybody, get up)--Okay, now he was close--Tried to domesticate you--But you're an animal--Baby, it's in your nature--Just let me liberate you (hey, hey, hey)--You don't need no papers (hey, hey, hey)--That man is not your maker (hey, hey, hey)--And that's why I'm gon' take a--Good girl--I know you want it--I know you want it--I know you want it--You're a good girl--Can't let it get past me--You're far from plastic--Talk about getting blasted--I hate these blurred lines (I hate them lines)--I know you want it (I hate them lines)--I know you want it (I hate them lines)--I know you want it--But you're a good girl--The way you grab me--Must wanna get nasty--Go ahead, get at me--One thing I ask of you--Let me be the one you back that ass up to (come on)--Go, from Malibu to Paris, boo--Yeah, had a bitch, but she ain't bad as you--So, hit me up when you pass through--I'll give you something big enough to tear your ass in two--Swag on 'em even when you dress casual--I mean, it's almost unbearable--In a hundred years not dare, would I?--Pull a Pharcyde, let you pass me by--Nothing like your last guy, he too square for you--He don't smack that ass and pull your hair for you (you like it)--So I'm just watching and waiting--For you to salute the truly pimping--Not many women can refuse this pimping--I'm a nice guy, but don't get confused, this pimping--Shake your rump--Get down, get up-a--Do it like it hurt, like it hurt--What you don't like work?--Hey! (Everybody, get up)--Baby, can you breathe?--I got this from Jamaica--It always works for me--Dakota to Decatur--No more pretending (hey, hey, hey)--'Cause now you winning (hey, hey, hey)--Here's our beginning (hey, hey, hey)--I always wanted a--Good girl--I know you want it--I know you want it--I know you want it--You're a good girl--Can't let it get past me--You're far from plastic--Talk about getting blasted--I hate these blurred lines--I know you want it--I know you want it--I know you want it--But you're a good girl--The way you grab me--Must wanna get nasty--Go ahead, get at me--Everybody, get up--Everybody, get up--Hey, hey, hey--"},
  { "id" : 3, "songs" : "Can't Hold Us", "singer" : "Macklemore & Ryan Lewis Featuring Ray Dalton", "lyrics": "--Ay, ay, ay--Good to see you, come on in, let's go--Yeah, let's go--Alright, alright--OK, uh, alright, OK--Alright, OK----Return of the Mack, get up!--What it is, what it does, what it is, what it isn't.--Looking for a better way to get up out of bed--Instead of getting on the Internet and checking a new hit me.----Get up! Thrift shop, pimp-strut walking, little bit of humble, little bit of cautious--Somewhere between like Rocky and Cosby. Sweater game, nope, nope y'all can't copy----Yup. Bad, moon-walking, this here is our party, my posse's been on Broadway,--And we did it our way.--Grown music, I shed my skin and put my bones into everything I record to it--And yet I'm on...----Let that stage light go and shine on down,--Got that Bob Barker suit game and Plinko in my style.----Money, stay on my craft and stick around for those pounds,--But I do that to pass the torch and put on for my town----Trust me. On my I-N-D-E-P-E-N-D-E-N-T shit, hustling,--Chasing dreams since I was fourteen with the four track bussing--Halfway cross that city with the backpack, fat cat, crush shit.----Labels out here,--Nah, they can't tell me nothing--We give that to the people,--Spread it across the country--Labels out here,--Nah, they can't tell me nothing--We give it to the people,--Spread it across the country----Can we go back? This is the moment--Tonight is the night, we'll fight 'til it's over--So we put our hands up like the ceiling can't hold us--Like the ceiling can't hold us----Can we go back? This is the moment--Tonight is the night, we'll fight 'til it's over--So we put our hands up like the ceiling can't hold us--Like the ceiling can't hold us----Nah, can I kick it? Thank you. Yeah I'm so damn grateful.--I grew up, really wanted gold fronts--But that's what you get when Wu-Tang raised you----Y'all can't stop me, go hard like I got an 808 in my heart beat--And I'm eating at the beat like you give a little speed to a great white shark on shark week----Raw. Tell me go up. Gone!--Deuces goodbye. I got a world to see, and my girl she wanna see Rome,--Caesar'll make you a believer.----Nah I never ever did it for a throne.--That validation comes from giving it back to the people.--Nah sing this song and it goes like----Raise those hands, this is our party--We came here to live life like nobody was watching--I got my city right behind me--If I fall, they got me.--Learn from that failure gain humility and then we keep marching. I said...----Can we go back? This is the moment--Tonight is the night, we'll fight 'til it's over--So we put our hands up like the ceiling can't hold us--Like the ceiling can't hold us----Can we go back? This is the moment--Tonight is the night, we'll fight 'til it's over--So we put our hands up like the ceiling can't hold us--Like the ceiling can't hold us----And so we put our hands up--And so we put our hands up----Wa oh oh oh wa oh oh oh wa oh oh--Let's go!----Na na na na na na na na (aha)--Hey--And all my people say----Na na na na na na na na (that's right, feels good)--Hey--And all my people say----Na na na na na na na na (it's alright)--(Oh oh oh oh oh oh oh oh)--And all my people say----Na na na na na na na na--Mack-le-le-le-le-le-more...----[Album version ending:]--Can we go back? This is the moment--Tonight is the night, we'll fight 'til it's over--So we put our hands up like the ceiling can't hold us--Like the ceiling can't hold us--Can we go back? This is the moment--Tonight is the night, we'll fight 'til it's over--So we put our hands up like the ceiling can't hold us--Like the ceiling can't hold us.----[Music video ending:]--Let the night come, before the fight's won--Some might run against the test--But those that triumph, embrace the fight 'cause--Their fears then prove that courage exists (c'mon)--Let the night come, before the fight's won--Some might run against the test--But those that triumph, embrace the fight 'cause--Their fears then prove that courage exists--"},
  { "id" : 4, "songs" : "Suit & Tie ", "singer" : "Justin Timberlake Featuring JAY Z", "lyrics": "--I be on my suit and tie shit, tie shit, tie--I be on my suit and tie shit, tie shit--Can I show you a few things?--A few things, a few things, little baby 'cause--I be on my suit and tie shit, tie shit--I be on my suit and tie shit, tie shit--Let me show you a few things--Let me show you a few things--Wait a minute, you ready, JT?--I can't wait 'til I get you on the floor, good-looking--Going out so hot, just like an oven--And I'll burn myself, but just had to touch it--It's so fly and it's all mine--Hey baby, we don't mind all the watching, hi--'Cause if they study close, real close, they might learn something--She ain't nothing but a little doozy when she does it--She's so fly (She's so fly) tonight--And as long as I've got my suit and tie--I'ma leave it all on the floor tonight--And you got fixed up to the nines--Let me show you a few things (show you a few things)--All pressed up in black and white--And you're dressed in that dress I like--Love is swinging in the air tonight--Let me show you a few things (show you a few things)--Let me show you a few things--Show you a few things, about love--While we're in the swing of love--Let me show you a few things--Show you a few things, about love, hey--Stop, let me get a good look at it--Ooh so thick, now I know why they call it a fatty--And oh shit so sick got a hit and picked up a habit--That's alright, 'cause you're all mine--Ooh go on and show 'em who you call daddy--I guess they're just mad 'cause girl, they wish they had it--Ooh my killer, my Thriller yeah you're a classic--And you're all mine tonight--And as long as I've got my suit and tie--I'ma leave it all on the floor tonight--And you got fixed up to the nines--Let me show you a few things (show you a few things)--All pressed up in black and white--And you're dressed in that dress I like--Love is swinging in the air tonight--Let me show you a few things (show you a few things)--Let me show you a few things--Show you a few things, about love--While we're in the swing of love--Let me show you a few things--Show you a few things, about love, hey--Get out ya seat, Hov, uh--All black at the white shows--White shoes at the black shows--Green card for the Cuban linx--Y'all sit back and enjoy the light show--Nothing exceeds like excess--Stoute got gout from having the best of the best, is this what it's all about?--I'm at the rest-aurant with my rent, disturbing the guests--Years of distress, tears on the dress--Try to hide her face with some makeup sex uh--This is truffle season--Tom Ford tuxedos for no reason--All Saints for my angel--Alexander Wang too--Ass-tight denim and some Dunks--I'll show you how to do this young uh!--No papers, catch vapors--Get high, out Vegas--D'usses on doubles, ain't looking for trouble--You just got good genes so a nigga tryna cuff you--Tell your mother that I love her 'cause I love you--Tell your father we go farther as a couple--They ain't lose a daughter, got a son--I show you how to do this hun!--As long as I've got my suit and tie--I'ma leave it all on the floor tonight--Baby got fixed up to the nines--Let me show you a few things (show you a few things)--All pressed up in black and white--And you're dressed in that dress I like--Love is swinging in the air tonight--Let me show you a few things (show you a few things)--Let me show you a few things--Show you a few things, about love (love, love)--(Let, let) Let me show you a few things--Show you a few things, about love, hey oh--"},
  { "id" : 5, "songs" : "Holy Grail", "singer" : "Jay Z Featuring Justin Timberlake", "lyrics": "--You'd take the clothes off my back and I'd let you--You'd steal the food right out my mouth--And I'd watch you eat it--I still won't know why, why I love you so much, mmh--You curse my name in spite to put me to shame--You hang all my laundry in the streets, dirty or clean--Give it up for fame--But I still don't know why, why I love it so much, mmh--But baby, it's amazin' I'm in a maze with you--I just can't crack your code--One day you're screamin' you love me loud--The next day you're so cold--Some days you're here, some days you're there--Some days you care, you're so unfair--Sippin' from your cup 'til I runneth over (uh, uh)--Holy Grail--Uh--Blue told me remind you niggas, uh--Fuck that shit y'all talking 'bout, I'm the nigga, uh--Caught up in all these lights and cameras, uh--But look what that shit did to Hammer, uh--Goddamn it, I like it--Bright lights is enticin', but look what it did to Tyson--All that money in one night, thirty mil' for one fight--But soon as all that money blows, all the pigeons take flight--Fuck the fame, keep cheatin' on me--What'd I do? I took her back--Fool me twice, that's my bad, I can't even blame her for that--Enough to make me wanna murder--Mama, please just get my bail--I know nobody to blame, Kurt Cobain, I did it to myself, uh--And we all just entertainers--I feel stupid and contagious--No, we all just entertainers--But baby, it's amazin' I'm in a maze with you--I just can't crack your code--One day you're screamin' you love me loud--The next day you're so cold--Some days you're here, some days you're there--Some days you care, you're so unfair--Sippin' from your cup 'til I runneth over--Holy Grail--Now I got tattoos on my body--Psycho bitches in my lobby--I got haters in the paper, photo shoots with paparazzi--Can't even take my daughter for a walk--See 'em by the corner store--I feel like I'm cornered off--Enough is enough, I'm callin' this off--Who the fuck I'm kiddin' though?--I'm gettin' high, sittin' low--Slidin' by in that big body, curtains all in my window--This fame hurt, but this chain worse--I think back you asked the same person--If this is all you had to deal with--Nigga, deal with, this shit ain't work--This light work, camera snappin', my eyes hurt--Niggas dying back where I was birthed--Fuck your iris and the IRS--Get the hell up off your high horse--You got the shit that niggas die for, dry yours--Why you mad? Take the good with the bad--Or throw the baby out with that bath water--You still alive, still that nigga--Nigga, you survived, you still gettin' bigger--Nigga, living the life, vanilla wafers in a villa--Illest nigga alive, Michael Jackson's Thriller--But baby, it's amazin' I'm in a maze with you--I just can't crack your code--One day you're screamin' you love me loud--The next day you're so cold--Some days you're here, some days you're there--Some days you care, you're so unfair--Sippin' from your cup 'til I runneth over--Holy Grail--You'd take the clothes off my back and I'd let you--You'd steal the food right out my mouth--And I'd watch you eat it--I still won't know why, why I love you so much, mmh--You curse my name in spite to put me to shame--You hang all my laundry in the streets, dirty or clean--Give it up for fame--But I still don't know why, why I love it so much, mmh--But baby, it's amazin' I'm in a maze with you--I just can't crack your code--One day you're screamin' you love me loud--The next day you're so cold--Some days you're here, some days you're there--Some days you care, you're so unfair--Sippin' from your cup 'til I runneth over--Holy Grail--"},
  { "id" : 6, "songs" : "Diamonds", "singer" : "Rihanna", "lyrics": "--Shine bright like a diamond--Shine bright like a diamond--Find light in the beautiful sea, I choose to be happy--You and I, you and I, we're like diamonds in the sky--You're a shooting star I see, a vision of ecstasy--When you hold me, I'm alive--We're like diamonds in the sky--I knew that we'd become one right away--Oh, right away--At first sight I felt the energy of sun rays--I saw the life inside your eyes--So shine bright tonight,--You and I--We're beautiful like diamonds in the sky--Eye to eye,--So alive--We're beautiful like diamonds in the sky--Shine bright like a diamond--Shine bright like a diamond--Shining bright like a diamond--We're beautiful like diamonds in the sky--Shine bright like a diamond--Shine bright like a diamond--Shining bright like a diamond--We're beautiful like diamonds in the sky--Palms rise to the universe, as we moonshine and molly--Feel the warmth, we'll never die--We're like diamonds in the sky--You're a shooting star I see, a vision of ecstasy--When you hold me, I'm alive--We're like diamonds in the sky--At first sight I felt the energy of sun rays--I saw the life inside your eyes--So shine bright--Tonight,--You and I--We're beautiful like diamonds in the sky--Eye to eye,--So alive--We're beautiful like diamonds in the sky--Shine bright like a diamond--Shine bright like a diamond--Shining bright like a diamond--We're beautiful like diamonds in the sky--Shine bright like a diamond--Shine bright like a diamond--Shining bright like a diamond--We're beautiful like diamonds in the sky--Shine bright like a diamond--Shine bright like a diamond--Shine bright like a diamond--So shine bright--Tonight,--You and I--We're beautiful like diamonds in the sky--Eye to eye,--So alive--We're beautiful like diamonds in the sky--Shine bright like a diamond--Shine bright like a diamond--Shine bright like a diamond--Shine bright like a diamond--Shine bright like a diamond--Shine bright like a diamond--"},
  { "id" : 7, "songs" : "Started From The Bottom", "singer" : "Drake", "lyrics": "--Started from the bottom, now we're here--Started from the bottom, now my whole team fuckin' here--Started from the bottom, now we're here--Started from the bottom, now the whole team here, nigga--Started from the bottom, now we're here--Started from the bottom, now my whole team here, nigga--Started from the bottom, now we're here--Started from the bottom, now the whole team fuckin' here--I done kept it real from the jump--Living at my mama house we'd argue every month--Nigga, I was tryna get it on my own--Workin' all night, traffic on the way home--And my uncle calling me like, Where ya at?--I gave you the keys told you bring it right back--Nigga, I just think it's funny how it goes--Now I'm on the road, half a million for a show--And we started from the bottom, now we're here--Started from the bottom, now my whole team fuckin' here--Started from the bottom, now we're here--Started from the bottom, now the whole team here, nigga--Started from the bottom, now we're here--Started from the bottom, now the whole team fuckin' here--Started from the bottom, now we're here--Started from the bottom, now the whole team here, nigga--Boys tell stories 'bout the man--Say I never struggled, wasn't hungry, yeah, I doubt it, nigga--I could turn your boy into the man--There ain't really much I hear that's poppin' off without us, nigga--We just want the credit where it's due--I'ma worry 'bout me, give a fuck about you--Nigga, just as a reminder to myself--I wear every single chain, even when I'm in the house--'Cause we started from the bottom, now we're here--Started from the bottom, now my whole team fuckin' here--Started from the bottom, now we're here--Started from the bottom, now the whole team here, nigga--No new niggas, nigga we don't feel that--Fuck a fake friend, where your real friends at?--We don't like to do too much explainin'--Story stay the same, I never changed it--No new niggas, nigga we don't feel that--Fuck a fake friend, where your real friends at?--We don't like to do too much explainin'--Story stay the same through the money and the fame--'Cause we started from the bottom, now we're here--Started from the bottom, now my whole team fuckin' here--Started from the bottom, now we're here--Started from the bottom, now the whole team here, nigga--Started from the bottom, now we're here--Started from the bottom, now my whole team here, nigga--Started from the bottom, now we're here--Started from the bottom, now the whole team here, nigga--"},
  { "id" : 8, "songs" : "F**kin Problems", "singer" : "A$AP Rocky Featuring Drake, 2 Chainz & Kendrick Lamar", "lyrics": "[2 Chainz & Drake:]--I love bad bitches, that's my fuckin' problem--And yeah, I like to fuck, I got a fuckin' problem--I love bad bitches, that's my fuckin' problem--And yeah, I like to fuck, I got a fuckin' problem--I love bad bitches, that's my fuckin' problem--(I love bad bitches, that's my fuckin' problem)--And yeah, I like to fuck, I got a fuckin' problem--(And yeah, I like to fuck, I got a fuckin' problem)--If findin' somebody real is your fuckin' problem--Bring your girls to the crib, maybe we can solve it----[A$AP Rocky:]--Hold up, bitches simmer down--Takin' hella long, bitch, give it to me now--Make that thing pop like a semi or a nine--Ooh, baby like it raw with the shimmy shimmy ya--Huh, A$AP, get like me--Never met a motherfucker fresh like me--All these motherfuckers wanna dress like me--Put the chrome to your dome, make you sweat like Keith--‘Cause I'm the nigga, the nigga nigga, like how you figure?--Gettin' figures and fuckin' bitches--She rollin' Swishers, brought her bitches--I brought my niggas, they gettin' bent up off the liquor--She love my licorice, I let her lick it--They say money make a nigga act nigga-ish--But least a nigga nigga rich--I be fuckin' broads like I be fuckin' bored--Turn a dyke bitch out, have her fuckin' boys; beast----[2 Chainz & Drake:]--I love bad bitches, that's my fuckin' problem--And yeah, I like to fuck, I got a fuckin' problem--I love bad bitches, that's my fuckin' problem--And yeah, I like to fuck, I got a fuckin' problem--I love bad bitches, that's my fuckin' problem--(I love bad bitches, that's my fuckin' problem)--And yeah, I like to fuck, I got a fuckin' problem--(And yeah, I like to fuck, I got a fuckin' problem)--If findin' somebody real is your fuckin' problem--Bring your girls to the crib, maybe we can solve it----[Drake:]--Ooh, I know you love it when this beat is on--Make you think about all of the niggas you've been leadin' on--Make me think about all of the rappers I've been feedin' on--Got a feelin' that's the same dudes that we speakin' on--Oh word? Ain't heard my album? Who you sleepin' on?--You should print the lyrics out and have a fuckin' read-along--Ain't a fuckin' sing-along 'less you brought the weed along--Then ju… (Okay, I got it)--Then just drop down and get yo' eagle on--Or we can stare up at the stars and put the Beatles on--All that shit you talkin' 'bout is not up for discussion--I will pay to make it bigger, I don't pay for no reduction--If it's comin' from a nigga I don't know, then I don't trust it--If you comin' for my head, then motherfucker get to bustin'--Yes, Lord, I don't really say this often--But this long-dick nigga ain't for the long talkin'; I'm beast----[2 Chainz & Drake:]--I love bad bitches, that's my fuckin' problem--And yeah, I like to fuck, I got a fuckin' problem--I love bad bitches, that's my fuckin' problem--And yeah, I like to fuck, I got a fuckin' problem--I love bad bitches, that's my fuckin' problem--(I love bad bitches, that's my fuckin' problem)--And yeah, I like to fuck, I got a fuckin' problem--(And yeah, I like to fuck, I got a fuckin' problem)--If findin' somebody real is your fuckin' problem--Bring your girls to the crib, maybe we can solve it----[Kendrick Lamar:]--Uh, yeah, ho, this the finale--My pep talk turn into a pep rally--Say she from the hood, but she live inside in the valley, now--Vaca'd in Atlanta, then she goin' back to Cali, mmm--Got your girl on my line, world on my line--The irony, I fuck 'em at the same damn time--She eyein' me like a nigga don't exist--Girl, I know you want this dick--Girl, I'm Kendrick Lamar--A.K.A. Benz is to me just a car--That mean your friends-es need be up to par--See, my standards are pampered by threesomes tomorrow--Mmm, kill 'em all, dead bodies in the hallway--Don't get involved, listen what the crystal ball say--Halle Berry, hallelujah--Holla back, I'll do ya; beast----[2 Chainz & Drake:]--I love bad bitches, that's my fuckin' problem--And yeah, I like to fuck, I got a fuckin' problem--I love bad bitches, that's my fuckin' problem--And yeah, I like to fuck, I got a fuckin' problem--I love bad bitches, that's my fuckin' problem--(I love bad bitches, that's my fuckin' problem)--And yeah, I like to fuck, I got a fuckin' problem--(And yeah, I like to fuck, I got a fuckin' problem)--If findin' somebody real is your fuckin' problem--Bring your girls to the crib, maybe we can solve it"},
  { "id" : 9, "songs" : "Hold On, We're Going Home", "singer" : "Drake Featuring Majid Jordan", "lyrics": "--Ooh, ooh--Ah, ah, ah-ha--Ooh, ooh--Ah, ah, ah-ha--I got my eyes on you--You're everything that I see--I want your hot love and emotion endlessly--I can't get over you--You left your mark on me--I want your hot love and emotion endlessly--'Cause you're a good girl and you know it--You act so different around me--'Cause you're a good girl and you know it--I know exactly who you could be--Just hold on, we're going home--Just hold on, we're going home--It's hard to do these things alone--Just hold on, we're going home--I got my eyes on you--You're everything that I see--I want your hot love and emotion endlessly--I can't get over you--You left your mark on me--I want your hot love and emotion endlessly--'Cause you're a good girl and you know it (oh yeah)--You act so different around me--'Cause you're a good girl and you know it--I know exactly who you could be--So just hold on, we're going home (going home)--Just hold on, we're going home (going home)--It's hard to do these things alone (things alone)--Just hold on, we're going home (going home)--You're the girl, you're the one--Gave you everything I loved--I think there's something, baby--I think there's something, baby--You're the girl, you're the one--Gave you everything I loved--I think there's something, baby--I think there's something, baby--'Cause you're a good girl and you know it--You act so different around me--'Cause you're a good girl and you know it--I know exactly who you could be, oh--Just hold on, we're going home (going home)--Just hold on, we're going home (going home)--It's hard to do these things alone (things alone)--Just hold on, we're going home (going home, going home)--"},
  { "id" : 10, "songs" : "Love Me", "singer" : "Lil Wayne Featuring Drake & Future", "lyrics": "--I'm on that good kush and alcohol (Mike WiLL Made-It)--I got some down bitches I can call--I don't know what I would do without y'all--Imma ball till the day I fall (ball, ball, ball)--Yeah, long as my bitches love me (my bitches love me)--(Yeah, yeah)--(Yeah, yeah)--I can give a fuck 'bout no hater--Long as my bitches love me (my bitches love me)--(Yeah, yeah)--(Yeah, yeah)--(Yeah, yeah) yeah--I can give a fuck 'bout no nigga--Long as these bitches love me--Uh, pussy ass nigga stop hating--Lil Tunechi got that fire--And these hoes love me like Satan, man!--Yeah, fuck with me and get bodied--And all she eat is dick--She's on a strict diet, that's my baby--With no makeup she a ten--And she the best with that head--Even better then Karrine--She don't want money--She want the time that we could spend--She said 'cause I really need somebody--So tell me you're that somebody--Girl, I fuck who I want and fuck who I don't--Got that A1 credit, that's that filet mignon--She said I never want to make you mad--I just want to make you proud--I said baby just make me cum--Then don't make no sound (Slick Tunechi)--I'm on that good kush and alcohol (yeah)--I got some down bitches I can call (what's hatnin'?)--I don't know what I would do without y'all--Imma ball till the day I fall (ball, ball, ball)--Yeah, long as my bitches love me (my bitches love me)--(Yeah, yeah)--(Yeah, yeah)--I can give a fuck 'bout no hater--Long as my bitches love me (my bitches love me)--(Yeah, yeah) (my bitches love me)--(Yeah, yeah) (my bitches love me)--(Yeah, yeah) yeah--I can give a fuck 'bout no nigga--Long as these bitches love me--Uh, real nigga fuck these haters--These hoes got pussies like craters--Can't treat these hoes like ladies, man!--Pussy, money, weed, codeine--She said my dick feel like morphine--I hope my name taste like sardines to these niggas--She wake up, eat this dick, call that breakfast in bed--69, 96, I feel her heartbeat--I chest to chest with this bitch--Now turn around, face down, I'm arrestin' this bitch--Yeah all my bitches love me and I love all my bitches--But its like as soon as I cum, I come to my senses--And I would say these hoes names--But then I would be snitching--And these haters try to knock me--But they can't knock me off the hinges (Tunechi)--I'm on that good kush and alcohol (yeah)--I got some down bitches I can call (what's hatnin'?)--I don't know what I would do without y'all--(I don't know what I would do without y'all)--Imma ball till the day I fall (Imma ball)--Yeah, long as my bitches love me (my bitches love me)--(Yeah, yeah)--(Yeah, yeah)--I can give a fuck 'bout no hater--Long as my bitches love me (my bitches love me)--(Yeah, yeah) (my bitches love me)--(Yeah, yeah) (my bitches love me)--(Yeah, yeah) yeah--I can give a fuck 'bout--I lost a few good bitches--Met some more bad bitches--And I be schooling them niggas--Pose for your class picture--Now kiss my ass if you hatin'--I'm gettin' ass while I'm skatin'--Yeah, I lost a few good bitches--Met some more bad bitches--I be schooling them niggas--Pose for your class picture--Now kiss my ass if you hatin'--I'm gettin' ass while I'm skatin' (bitch)--I'm on that good kush and alcohol (Tunechi)--I got some down bitches I can call (what's hatnin'?)--I don't know what I would do without y'all--(I don't know what I would do without y'all)--Imma ball till the day I fall (Imma ball)--Yeah, long as my bitches love me (my bitches love me)--(Yeah, yeah)--(Yeah, yeah)--I can give a fuck 'bout no hater--Long as my bitches love me (my bitches love me)--(Yeah, yeah) (my bitches love me)--(Yeah, yeah) (my bitches love me)--(Yeah, yeah) yeah--I can give a fuck 'bout no nigga--"}

]

